Revit 2025 API
TextTreatment Enumeration
 An enumerated type listing possible text treatment modes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TextTreatment
Public Enumeration TextTreatment
public enum class TextTreatment
type TextTreatment
Members
Member name | Value | Description
Exact | 0 |  Export texts as exact visual fidelity. Formatting intelligence will be lost.
Approximate | 1 |  Export texts as approximate visual fidelity. Formatting intelligence will be maintained.
See Also
Reference
Autodesk.Revit.DB Namespace